cases/Level1_TransverseFin/0/U
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.5 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.5 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    topWall
    {
        type            noSlip;
    }

    baseWall
    {
        type            noSlip;
    }

    heatedFins
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}
