cases/Level1_TransverseFin/0/p
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    topWall
    {
        type            zeroGradient;
    }

    baseWall
    {
        type            zeroGradient;
    }

    heatedFins
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
    }
}
