cases/Level1_TransverseFin/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (0.000 0.000 0.000)
    (0.070 0.000 0.000)
    (0.072 0.000 0.000)
    (0.082 0.000 0.000)
    (0.084 0.000 0.000)
    (0.094 0.000 0.000)
    (0.096 0.000 0.000)
    (0.106 0.000 0.000)
    (0.108 0.000 0.000)
    (0.118 0.000 0.000)
    (0.120 0.000 0.000)
    (0.200 0.000 0.000)

    (0.000 0.030 0.000)
    (0.070 0.030 0.000)
    (0.072 0.030 0.000)
    (0.082 0.030 0.000)
    (0.084 0.030 0.000)
    (0.094 0.030 0.000)
    (0.096 0.030 0.000)
    (0.106 0.030 0.000)
    (0.108 0.030 0.000)
    (0.118 0.030 0.000)
    (0.120 0.030 0.000)
    (0.200 0.030 0.000)

    (0.000 0.060 0.000)
    (0.070 0.060 0.000)
    (0.072 0.060 0.000)
    (0.082 0.060 0.000)
    (0.084 0.060 0.000)
    (0.094 0.060 0.000)
    (0.096 0.060 0.000)
    (0.106 0.060 0.000)
    (0.108 0.060 0.000)
    (0.118 0.060 0.000)
    (0.120 0.060 0.000)
    (0.200 0.060 0.000)

    (0.000 0.000 0.010)
    (0.070 0.000 0.010)
    (0.072 0.000 0.010)
    (0.082 0.000 0.010)
    (0.084 0.000 0.010)
    (0.094 0.000 0.010)
    (0.096 0.000 0.010)
    (0.106 0.000 0.010)
    (0.108 0.000 0.010)
    (0.118 0.000 0.010)
    (0.120 0.000 0.010)
    (0.200 0.000 0.010)

    (0.000 0.030 0.010)
    (0.070 0.030 0.010)
    (0.072 0.030 0.010)
    (0.082 0.030 0.010)
    (0.084 0.030 0.010)
    (0.094 0.030 0.010)
    (0.096 0.030 0.010)
    (0.106 0.030 0.010)
    (0.108 0.030 0.010)
    (0.118 0.030 0.010)
    (0.120 0.030 0.010)
    (0.200 0.030 0.010)

    (0.000 0.060 0.010)
    (0.070 0.060 0.010)
    (0.072 0.060 0.010)
    (0.082 0.060 0.010)
    (0.084 0.060 0.010)
    (0.094 0.060 0.010)
    (0.096 0.060 0.010)
    (0.106 0.060 0.010)
    (0.108 0.060 0.010)
    (0.118 0.060 0.010)
    (0.120 0.060 0.010)
    (0.200 0.060 0.010)
);

blocks
(
    hex (0 1 13 12 36 37 49 48) (35 30 1) simpleGrading (1 1 1)
    hex (2 3 15 14 38 39 51 50) (10 30 1) simpleGrading (1 1 1)
    hex (4 5 17 16 40 41 53 52) (10 30 1) simpleGrading (1 1 1)
    hex (6 7 19 18 42 43 55 54) (10 30 1) simpleGrading (1 1 1)
    hex (8 9 21 20 44 45 57 56) (10 30 1) simpleGrading (1 1 1)
    hex (10 11 23 22 46 47 59 58) (40 30 1) simpleGrading (1 1 1)

    hex (12 13 25 24 48 49 61 60) (35 30 1) simpleGrading (1 1 1)
    hex (13 14 26 25 49 50 62 61) (2 30 1) simpleGrading (1 1 1)
    hex (14 15 27 26 50 51 63 62) (10 30 1) simpleGrading (1 1 1)
    hex (15 16 28 27 51 52 64 63) (2 30 1) simpleGrading (1 1 1)
    hex (16 17 29 28 52 53 65 64) (10 30 1) simpleGrading (1 1 1)
    hex (17 18 30 29 53 54 66 65) (2 30 1) simpleGrading (1 1 1)
    hex (18 19 31 30 54 55 67 66) (10 30 1) simpleGrading (1 1 1)
    hex (19 20 32 31 55 56 68 67) (2 30 1) simpleGrading (1 1 1)
    hex (20 21 33 32 56 57 69 68) (10 30 1) simpleGrading (1 1 1)
    hex (21 22 34 33 57 58 70 69) (2 30 1) simpleGrading (1 1 1)
    hex (22 23 35 34 58 59 71 70) (40 30 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 36 48 12)
            (12 48 60 24)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (11 23 59 47)
            (23 35 71 59)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (24 25 61 60)
            (25 26 62 61)
            (26 27 63 62)
            (27 28 64 63)
            (28 29 65 64)
            (29 30 66 65)
            (30 31 67 66)
            (31 32 68 67)
            (32 33 69 68)
            (33 34 70 69)
            (34 35 71 70)
        );
    }

    baseWall
    {
        type wall;
        faces
        (
            (0 36 37 1)
            (2 38 39 3)
            (4 40 41 5)
            (6 42 43 7)
            (8 44 45 9)
            (10 46 47 11)
        );
    }

    heatedFins
    {
        type wall;
        faces
        (
            (1 13 49 37)
            (2 38 50 14)
            (13 49 50 14)

            (3 15 51 39)
            (4 40 52 16)
            (15 51 52 16)

            (5 17 53 41)
            (6 42 54 18)
            (17 53 54 18)

            (7 19 55 43)
            (8 44 56 20)
            (19 55 56 20)

            (9 21 57 45)
            (10 46 58 22)
            (21 57 58 22)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 12 13 1)
            (36 37 49 48)

            (2 14 15 3)
            (38 39 51 50)

            (4 16 17 5)
            (40 41 53 52)

            (6 18 19 7)
            (42 43 55 54)

            (8 20 21 9)
            (44 45 57 56)

            (10 22 23 11)
            (46 47 59 58)

            (12 24 25 13)
            (48 49 61 60)

            (13 25 26 14)
            (49 50 62 61)

            (14 26 27 15)
            (50 51 63 62)

            (15 27 28 16)
            (51 52 64 63)

            (16 28 29 17)
            (52 53 65 64)

            (17 29 30 18)
            (53 54 66 65)

            (18 30 31 19)
            (54 55 67 66)

            (19 31 32 20)
            (55 56 68 67)

            (20 32 33 21)
            (56 57 69 68)

            (21 33 34 22)
            (57 58 70 69)

            (22 34 35 23)
            (58 59 71 70)
        );
    }
);

mergePatchPairs
(
);
