cases/Level1_TransverseFin/system/controlDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     foamRun;

solver          incompressibleFluid;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         6000;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    temperatureTransport
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");

        field           T;

        diffusivity     constant;

        D               2.2e-05;
    }
